In [1]:
import numpy as np
import pandas as pd
%matplotlib inline

In [3]:
movie = pd.read_csv('~/Documents/Stepik + ODS/data/movie_metadata.csv')

In [5]:
genres = movie[['movie_title', 'genres']]

In [6]:
budget=movie[['budget', 'duration']]

In [7]:
budget.applymap(lambda x: x + 1) # применяет ф-цию к каждому значению датасета

           budget  duration
0     237000001.0     179.0
1     300000001.0     170.0
2     245000001.0     149.0
3     250000001.0     165.0
4             NaN       NaN
...           ...       ...
5038          NaN      88.0
5039          NaN      44.0
5040       1401.0      77.0
5041          NaN     101.0
5042       1101.0      91.0

[5043 rows x 2 columns]

In [8]:
budget.apply(np.mean, axis=0) # применяет функцию к колонке, или к строке

budget      3.975262e+07
duration    1.072011e+02
dtype: float64

In [9]:
budget.transform(lambda x: x + 1)

           budget  duration
0     237000001.0     179.0
1     300000001.0     170.0
2     245000001.0     149.0
3     250000001.0     165.0
4             NaN       NaN
...           ...       ...
5038          NaN      88.0
5039          NaN      44.0
5040       1401.0      77.0
5041          NaN     101.0
5042       1101.0      91.0

[5043 rows x 2 columns]

In [10]:
def mm(col):
    return np.mean(col) + 1

In [11]:
budget.apply(mm)

budget      3.975262e+07
duration    1.082011e+02
dtype: float64

In [12]:
# np array выигрывает в скорости по сравнению с pd.DataFrame
np.mean(budget['budget'].values)

nan

In [13]:
# но и имеет свои неудобства: применяем dropna() чтобы посчитать mean()
np.mean(budget['budget'].dropna().values)

39752620.436387606

In [16]:
df = pd.read_csv('https://stepik.org/media/attachments/course/4852/iris.csv')

In [24]:
%%time
df.apply(np.mean)

CPU times: user 3.59 ms, sys: 0 ns, total: 3.59 ms
Wall time: 3.42 ms

Unnamed: 0      74.500000
sepal length     5.843333
sepal width      3.054000
petal length     3.758667
petal width      1.198667
species          1.000000
dtype: float64

In [25]:
%%time
df.apply('mean')

CPU times: user 609 µs, sys: 13 µs, total: 622 µs
Wall time: 592 µs

Unnamed: 0      74.500000
sepal length     5.843333
sepal width      3.054000
petal length     3.758667
petal width      1.198667
species          1.000000
dtype: float64

In [26]:
%%time
df.mean(axis=0)

CPU times: user 498 µs, sys: 0 ns, total: 498 µs
Wall time: 464 µs

Unnamed: 0      74.500000
sepal length     5.843333
sepal width      3.054000
petal length     3.758667
petal width      1.198667
species          1.000000
dtype: float64

In [27]:
%%time
df.describe().loc['mean']

CPU times: user 23.2 ms, sys: 3.98 ms, total: 27.2 ms
Wall time: 25.9 ms

Unnamed: 0      74.500000
sepal length     5.843333
sepal width      3.054000
petal length     3.758667
petal width      1.198667
species          1.000000
Name: mean, dtype: float64

In [28]:
stock=pd.read_csv('https://raw.githubusercontent.com/PacktPublishing/Pandas-Cookbook/master/data/amzn_stock.csv')

In [29]:
stock.head()

         Date    Open    High     Low   Close    Volume
0  2010-01-04  136.25  136.61  133.14  133.90   7600543
1  2010-01-05  133.43  135.48  131.81  134.69   8856456
2  2010-01-06  134.60  134.73  131.65  132.25   7180977
3  2010-01-07  132.01  132.32  128.80  130.00  11030124
4  2010-01-08  130.56  133.68  129.03  133.52   9833829

In [30]:
# делаем дату индексом
stock=pd.read_csv('https://raw.githubusercontent.com/PacktPublishing/Pandas-Cookbook/master/data/amzn_stock.csv',
                  index_col='Date', parse_dates=True)

In [31]:
stock['2010']

              Open    High     Low   Close    Volume
Date
2010-01-04  136.25  136.61  133.14  133.90   7600543
2010-01-05  133.43  135.48  131.81  134.69   8856456
2010-01-06  134.60  134.73  131.65  132.25   7180977
2010-01-07  132.01  132.32  128.80  130.00  11030124
2010-01-08  130.56  133.68  129.03  133.52   9833829
...            ...     ...     ...     ...       ...
2010-12-27  181.90  183.14  180.45  182.14   2249734
2010-12-28  182.10  182.77  181.05  181.09   1975718
2010-12-29  181.80  184.35  180.41  183.37   3122379
2010-12-30  183.92  184.55  182.75  182.75   1961549
2010-12-31  181.96  182.30  179.51  180.00   3453895

[251 rows x 5 columns]

In [32]:
stock['2010-02':'2011-03']

              Open    High     Low   Close    Volume
Date
2010-02-01  123.18  124.86  113.82  118.87  37774317
2010-02-02  118.79  118.98  114.40  118.12  23084986
2010-02-03  117.12  119.61  116.56  119.10  12409012
2010-02-04  118.64  120.33  115.74  115.94  12783912
2010-02-05  115.88  117.65  114.10  117.39  11027086
...            ...     ...     ...     ...       ...
2011-03-25  171.64  173.49  170.30  170.98   4294302
2011-03-28  171.80  172.50  169.25  169.35   3400936
2011-03-29  170.73  174.84  170.07  174.62   4887443
2011-03-30  177.78  181.16  177.66  179.42   6860586
2011-03-31  179.31  181.57  178.50  180.13   4828345

[294 rows x 5 columns]

In [33]:
stock.resample('2h').asfreq()

                        Open     High      Low    Close     Volume
Date
2010-01-04 00:00:00   136.25   136.61   133.14   133.90  7600543.0
2010-01-04 02:00:00      NaN      NaN      NaN      NaN        NaN
2010-01-04 04:00:00      NaN      NaN      NaN      NaN        NaN
2010-01-04 06:00:00      NaN      NaN      NaN      NaN        NaN
2010-01-04 08:00:00      NaN      NaN      NaN      NaN        NaN
...                      ...      ...      ...      ...        ...
2017-07-16 16:00:00      NaN      NaN      NaN      NaN        NaN
2017-07-16 18:00:00      NaN      NaN      NaN      NaN        NaN
2017-07-16 20:00:00      NaN      NaN      NaN      NaN        NaN
2017-07-16 22:00:00      NaN      NaN      NaN      NaN        NaN
2017-07-17 00:00:00  1004.69  1014.75  1003.81  1010.04  3668721.0

[33013 rows x 5 columns]

In [34]:
stock.resample('1w').mean()

                 Open      High        Low     Close       Volume
Date
2010-01-10   133.3700   134.564   130.8860   132.872   8900385.80
2010-01-17   129.5660   130.472   126.9940   128.252  10756782.40
2010-01-24   126.5475   128.255   123.7925   125.360   9883903.25
2010-01-31   123.5780   125.528   120.5840   122.796  18627194.20
2010-02-07   118.7220   120.286   114.9240   117.884  19415862.60
...               ...       ...        ...       ...          ...
2017-06-25  1003.6940  1007.236   993.9580   999.006   3435057.40
2017-07-02   987.3720   994.062   974.0140   981.004   3719885.20
2017-07-09   967.1325   976.000   958.6025   967.240   3116265.75
2017-07-16   997.1340  1003.062   991.6220   999.910   3024161.20
2017-07-23  1004.6900  1014.750  1003.8100  1010.040   3668721.00

[394 rows x 5 columns]